[gold]
read_verilog -sv ./results/asap7/aes/base/4_before_rsz.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_SEQ_RVT_TT_220101.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_AO_RVT_TT_201020.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_INVBUF_RVT_TT_201020.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_OA_RVT_TT_201020.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc6t_INVBUF_RVT_FF_210930.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_SIMPLE_RVT_TT_201020.v

prep -top aes_cipher_top -flatten
memory_map


[gate]
read_verilog -sv ./results/asap7/aes/base/4_after_rsz.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_SEQ_RVT_TT_220101.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_AO_RVT_TT_201020.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_INVBUF_RVT_TT_201020.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_OA_RVT_TT_201020.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc6t_INVBUF_RVT_FF_210930.v /OpenROAD-flow-scripts/flow/platforms/asap7/work_around_yosys/asap7sc7p5t_SIMPLE_RVT_TT_201020.v

prep -top aes_cipher_top -flatten
memory_map


[match *]
gate-nomatch _*_.*
gate-nomatch net*
gate-nomatch clone*


[strategy basic]
use sat
depth 10


[strategy sby]
use sby
depth 10
engine smtbmc bitwuzla


